app/views/entries/show.html.erb

    <h2>Comments</h2>
<% if @entry.comments.length > 1 %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."entry_id" = ?  [["entry_id", 9]]