app/controllers/categories_controller.rb

SELECT  "entries".* FROM "entries"  WHERE "entries"."category_id" = ?  ORDER BY id DESC LIMIT 5 OFFSET 0  [["category_id", 3]]
SELECT COUNT(*) FROM "entries"  WHERE "entries"."category_id" = ?  [["category_id", 3]]
---
  def show
    @entries = @category.entries.order("id DESC").paginate(:page => params[:page],:per_page => 5)

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-28 23:37:13.801539"], ["name", "deneme"], ["updated_at", "2014-10-28 23:37:13.801539"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save