app/controllers/comments_controller.rb

  def create
     params.permit!
     @entry = Entry.find(params[:entry_id])
     @comment = @entry.comments.create(params[:comment])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "comments" ("author", "body", "created_at", "entry_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "sad"], ["body", "asdasdasd"], ["created_at", "2014-11-02 11:14:34.046983"], ["entry_id", 17], ["updated_at", "2014-11-02 11:14:34.046983"]]

  def destroy
    @comment.destroy
    @entry = Entry.find(params[:entry_id])
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 13]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 21]]