app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
SELECT "categories".* FROM "categories"
---
  def index
    @entries = Entry.all
    @categories = Category.all

SELECT "entries".* FROM "entries"
---
  def feed
    @entries = Entry.all

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "entries" ("category_id", "content", "created_at", "tag", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category_id", 3], ["content", "ZZZ"], ["created_at", "2014-10-29 17:58:11.717641"], ["tag", "ZZZ"], ["title", "ZZ"], ["updated_at", "2014-10-29 17:58:11.717641"], ["user_id", 1]]
---
  def create
    @entry = Entry.new(entry_params)
    @entry.user = current_user
    @entry.category = Category.find(params[:category_id])

    respond_to do |format|
      if @entry.save

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "entries" SET "category_id" = ?, "updated_at" = ? WHERE "entries"."id" = 21  [["category_id", 4], ["updated_at", "2014-11-02 13:27:31.301078"]]
---
  def update
    @entry.user = current_user
    @entry.category = Category.find(params[:category_id])
     respond_to do |format|
      if @entry.update(entry_params)