app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "entries".* FROM "entries"   ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "entries"
---
  def index
  	@categories = Category.all
    @entries = Entry.all.order("id DESC").paginate(:page => params[:page],:per_page => 5)