app/controllers/pages_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
  	@categories = Category.all
    @entries = Entry.all